{
  "cf3b6192-0eb6-47c2-bc50-cc2543d4ee71": {
    "dimensions": ["Drugari", "Bosanski", "Japanski"],
    "variables": {
      "Drugari": ["Naida", "Alina", "Tina", "Mia Miko", "David", "Zen"],
      "Bosanski": [
        "Trešnja",
        "Bor",
        "Bambus",
        "Svilena buba",
        "Kišobran",
        "Šljiva"
      ],
      "Japanski": ["Matsu", "Kaiko", "Sakura", "Kasa", "Ume", "Take"]
    },
    "introduction": "Drugari su bili u posjeti Japanu i svako je kupio neki od japanskih simbola. Usput su i naučili kako se koji simbol izgovara na japanskom. Otkrijte šta su kupili drugari.",
    "clues": [
      "Tina je kupila nešto što na japanskom ima više od tri slova.",
      "Bambus na japanskom ima više od tri a manje od pet slova.",
      "Ni Zen ni Mia Miko nisu kupili Kaiko.",
      "Naida je kupila Ume što nije svilena buba.",
      "Alina je kupila trešnju što nije Take.",
      "Kasa i Kišobran su isti pojmovi.",
      "David nije kupio ništa što je biljka.",
      "Trešnja na bosanskom i japanskom imaju isti broj slova.",
      "Svilenu bubu je kupio neko čije ime ima manje od 5 slova.",
      "Mia Miko je kupila nešto sa najmanjim brojem slova na bosanskom."
    ]
  },
  "32d5f1ca-405c-4bbd-b429-f8735e2f2748": {
    "dimensions": ["Ime", "Patike", "Kaiš"],
    "variables": {
      "Ime": ["Zen", "Mia Miko", "Naida"],
      "Patike": ["Plave", "Smeđe", "Žute"],
      "Kaiš": ["Plavi", "Smeđi", "Žuti"]
    },
    "introduction": "",
    "clues": [
      "Svako od prijatelja ima patike i kaiš različite boje",
      "Mia Miko nema plave patike",
      "Naida ima žuti kaiš i nema plave patike"
    ]
  },
  "915ef98a-5710-445c-89c7-5db472439873": {
    "dimensions": ["Prijatelji", "Sport", "Igračka"],
    "variables": {
      "Prijatelji": ["Boris", "Hrvoje", "Alma", "Azra", "Lejla", "Adnan"],
      "Sport": [
        "Košarka",
        "Nogomet",
        "Biciklizam",
        "Džudo",
        "Tenis",
        "Plivanje"
      ],
      "Igračka": ["Autić", "Lopta", "Računar", "Romobil", "Olovka", "Šator"]
    },
    "introduction": "Šest prijatelja, svako ima svoj sport i svoju omiljenu igračku. Otkrijte detalje.",
    "clues": [
      "Ženska osoba koja voli džudo ima svoj šator.",
      "Osoba koja igra košarku ne voli autiće.",
      "Alma vozi romobil i ne igra tenis.",
      "Boris se igra vozićem i ne igra košarku.",
      "Muška osoba koja igra nogomet voli računare.",
      "Lejla i Hrvoje nemaju autiće niti treniraju biciklizam.",
      "Adnan voli svoju loptu a ne trenira nogomet.",
      "Osoba koja voli biciklizam voli i romobil.",
      "Azra trenira u bazenu."
    ]
  }
    "f6b292c7-0a1d-484c-935d-e9526a7f25e8": {
    "dimensions": ["Prijatelji", "Pseudonim", "Knjiga"],
    "variables": {
      "Prijatelji": ["Irena", "Ogi", "Haris", "Andrea", "Danko", "Belma"],
      "Pseudonim": [
        "Thor",
        "Finn",
        "Anansi",
        "Maui",
        "Lludd",
        "Bhubesi"
      ],
      "Knjiga": ["Ptice", "Kornjače", "Majmuni", "Lisice", "Orlovi", "Lavovi"]
    },
    "introduction": "Prijatelji su odlučili pisati knjige o životinjama. Nisu željeli otkriti svoje pravo ime pa su pisali pod pseudonimima. Otkrijte ko je napisao koju knjigu u pod kojim pseudonimom.",
    "clues": [
      "Ogijev pseudonim ima više od pet slova.",
      "Belma i Irena nisu pisali o kornjačama.",
      "Thor je pisao o životinjama koje počinju slovom L.",
      "Danko nije Maui niti je pisao o majmunima.",
      "Anansi i Lludd nisu pisali o madvjedima.",
      "Finn je zapravo Haris, i nije pisao o orlovima.",
      "Andrea je pisala o životinjama čije zadnje slovo nije I.",
      "Bhubesi je pseudonim muške osobe koja je pisala o Kornjačama.",
      "Lludd je ženska osoba sa manje od 6 slova u imenu."
      "Irenin pseudonim ima slovo O."
      "Ogi je pisao o majmunima."
    ]
  }
}
